app/controllers/document_types_controller.rb

SELECT "document_types".* FROM "document_types"
---
  def index
    @document_types = DocumentType.all