app/controllers/genders_controller.rb

  def index
    @genders = Gender.all
---
SELECT "genders".* FROM "genders"