app/controllers/matrix_types_controller.rb

SELECT "matrix_types".* FROM "matrix_types"
---
  def index
    @matrix_types = MatrixType.all

SELECT  "matrix_types".* FROM "matrix_types" WHERE "matrix_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_matrix_type
      @matrix_type = MatrixType.find(params[:id])