app/controllers/params_controller.rb

  def index
    if @param_category
      json_response(@param_category.params)
    else
      @params = Param.all
---
SELECT "params".* FROM "params"

  def create
    @param = Param.new(param_params)

    if @param.save
---
INSERT INTO "params" ("param_category_id", "param_table_id", "name", "english_name", "description", "created_at", "updated_at", "weighting") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_param_category
      if params[:param_category_id]
        @param_category = ParamCategory.find(params[:param_category_id])
---
SELECT  "param_categories".* FROM "param_categories" WHERE "param_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]