app/controllers/param_categories_controller.rb

  def index
    # @param_categories = ParamCategory.all
    if @param_matrix
      json_response(@param_matrix.param_categories)
    else
      @param_categories = ParamCategory.all
---
SELECT "param_categories".* FROM "param_categories"

  def create
    @param_category = ParamCategory.new(param_category_params)

    if @param_category.save
---
INSERT INTO "param_categories" ("param_matrix_id", "name", "english_name", "weighting", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @param_category.update(param_category_params)
---
UPDATE "param_categories" SET "english_name" = $1, "updated_at" = $2 WHERE "param_categories"."id" = $3  [["english_name", "Products & Services"], ["updated_at", "2017-10-02 23:40:10.000568"], ["id", 1]]

    def set_param_category
      @param_category = ParamCategory.find(params[:id])
---
SELECT  "param_categories".* FROM "param_categories" WHERE "param_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]