app/controllers/param_tables_controller.rb

SELECT "param_tables".* FROM "param_tables"
---
  def index
    @param_tables = ParamTable.all

INSERT INTO "param_tables" ("table_type_id", "name", "english_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["table_type_id", 1], ["name", "Situación Laboral"], ["english_name", "Employment Situation"], ["created_at", "2017-09-30 00:18:34.669960"], ["updated_at", "2017-09-30 00:18:34.669960"]]
---
  def create
    @param_table = ParamTable.new(param_table_params)

    if @param_table.save

UPDATE "param_tables" SET "english_name" = $1, "updated_at" = $2 WHERE "param_tables"."id" = $3  [["english_name", "Entity Type"], ["updated_at", "2017-09-30 21:00:37.611250"], ["id", 2]]
---
  def update
    if @param_table.update(param_table_params)

SELECT  "param_tables".* FROM "param_tables" WHERE "param_tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_param_table
      @param_table = ParamTable.find(params[:id])