app/controllers/param_sub_values_controller.rb

  def index
    @param_sub_values = ParamSubValue.all
---
SELECT "param_sub_values".* FROM "param_sub_values"

  def create
    @param_sub_value = ParamSubValue.new(param_sub_value_params)

    if @param_sub_value.save
---
INSERT INTO "param_sub_values" ("param_value_id", "name", "english_name", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["param_value_id", 20], ["name", "Pesca"], ["english_name", "Fishing"], ["score", 8.0], ["created_at", "2017-10-01 01:01:45.915452"], ["updated_at", "2017-10-01 01:01:45.915452"]]

  def update
    if @param_sub_value.update(param_sub_value_params)
---
UPDATE "param_sub_values" SET "english_name" = $1, "updated_at" = $2 WHERE "param_sub_values"."id" = $3  [["english_name", "Oil Refinery"], ["updated_at", "2017-10-04 19:41:25.925010"], ["id", 5]]

    def set_param_sub_value
      @param_sub_value = ParamSubValue.find(params[:id])
---
SELECT  "param_sub_values".* FROM "param_sub_values" WHERE "param_sub_values"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]