app/controllers/param_values_controller.rb

SELECT "param_values".* FROM "param_values"
---
  def index
    # @param_values = ParamValue.all
    if @param_table
      json_response(@param_table.param_values)
    else
      @param_values = ParamValue.all

INSERT INTO "param_values" ("param_table_id", "name", "english_name", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["param_table_id", 1], ["name", "Empleado"], ["english_name", "Employed"], ["score", 5.0], ["created_at", "2017-09-30 00:35:26.843950"], ["updated_at", "2017-09-30 00:35:26.843950"]]
---
  def create
    @param_value = ParamValue.new(param_value_params)

    if @param_value.save

UPDATE "param_values" SET "english_name" = $1, "updated_at" = $2 WHERE "param_values"."id" = $3  [["english_name", "Administrative assistant"], ["updated_at", "2017-10-04 19:37:56.985439"], ["id", 45]]
---
  def update
    if @param_value.update(param_value_params)

SELECT  "param_values".* FROM "param_values" WHERE "param_values"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def set_param_value
      @param_value = ParamValue.find(params[:id])

SELECT  "param_tables".* FROM "param_tables" WHERE "param_tables"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_param_table
      if params[:param_table_id]
        @param_table = ParamTable.find(params[:param_table_id])