app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT "participants".* FROM "participants"

    def set_participant
      @participant = Participant.find(params[:id])
---
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]