app/controllers/relationship_types_controller.rb

  def index
    @relationship_types = RelationshipType.all
---
SELECT "relationship_types".* FROM "relationship_types"