app/controllers/table_types_controller.rb

  def index
    @table_types = TableType.all
---
SELECT "table_types".* FROM "table_types"