app/controllers/task_statuses_controller.rb

SELECT "task_statuses".* FROM "task_statuses"
---
  def index
    @task_statuses = TaskStatus.all