app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("user_name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_name", "Joel Nieto"], ["password", "123456"], ["email", "joel.nieto@andersoft.com"], ["created_at", "2017-09-30 00:13:24.705190"], ["updated_at", "2017-09-30 00:13:24.705190"]]